lib/metadata_services/deploy_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata">
   <soapenv:Header>
      <met:DebuggingHeader>
        <!-- insert debuggin level setting here -->
        %s
      </met:DebuggingHeader>
      <met:SessionHeader>
         <met:sessionId>%s</met:sessionId>
      </met:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <met:deploy>
        <met:ZipFile>%s</met:ZipFile>
         <met:DeployOptions>
           <!-- deploy options like check_only, run_tests, etc -->
           %s
         </met:DeployOptions>
      </met:deploy>
   </soapenv:Body>
</soapenv:Envelope>
